Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Modularity .................................................5 1.4.
ja: モジュール方式 .................................................5 1.4.

source: MD5 is used here for historical reasons.
ja: MD5 が利用されているのは歴史的な理由による.

source: Implementations MUST skip over these messages by searching for an 'xml' start directive, which MUST be followed by a <hello> element in the 'NETCONF' namespace.
ja: 実装は, 'xml' の開始ディレクティブを探してこれらのメッセージをスキップしなければならない. この後には 'NETCONF' 名前空間の <hello> 要素が続いていなければならない.

source: Because the protocol is extensible, future extensions to the protocol may provide better mechanisms for dealing with the need to know the server's host key before connecting.
ja: プロトコルは拡張可能なので, プロトコルの将来の拡張で, 接続前にサーバのホスト鍵を知る必要性を取り扱うよりより仕組みが提供されるかもしれない.

source: It also specifies channels for accessing an interactive shell, for proxy-forwarding various external protocols over the secure transport (including arbitrary TCP/IP protocols), and for accessing secure subsystems on the server host.
ja: また, インタラクティブなシェルにアクセスするチャンネル, 任意のTCP/IPプロトコルを含む外部のプロトコルを安全なトランスポート上でプロシキし転送するチャンネル, サーバホストの安全なサブシスムにアクセスするチャンネルを定義する.

source: The 'maximum packet size' specifies the maximum size of an individual data packet that can be sent to the sender.
ja: 'maximum packet size' は, 送り手に送ることができる1つのデータパケットの最大サイズを指定する.

source: Access control decisions are therefore made based on the contents of the SNMP message, rather than using the authenticated identity and securityLevel provided by the SSH Transport Model.
ja: アクセス制御は, SSH トランスポートモデルで提供される 認証された識別情報と securityLevel を用いる代わりに, SNMP メッセージの内容に基づいて決定されなければならない.

source: The motivations for recommendations (1) and (2) are different, and we consider each recommendation in turn.
ja: 推奨(1)と(2)の動機は異なるので, それぞれの推奨について順番に考察する.

source: An invocation of AES GCM to perform an authenticated encryption has the following inputs and outputs:
ja: 認証付きの暗号化を実行する AES GCM の実行は, 次の入力と出力を持つ:

source: Non-Encryption of Packet Length ............................8 9.
ja: Packet Length の非暗号化 ............................8 9.

source: For the purposes of user authentication, the mapping between certificates and user names is left as an implementation and configuration issue for implementers and system administrators.
ja: ユーザ認証のための証明書とユーザ名とのマッピングは, 実装者とシステム管理者に対して実装と設定の問題として残されている.

source: The following table identifies the initial assignments of the key exchange methods.
ja: 次の表で, 鍵交換法の初期の割り当てを示す.

source: In any case, the character set for the terminal session is considered primarily a client local issue.
ja: どの場合でも, 端末セッションの文字セットは, 第一にクライアントのローカルな問題と考えられる.

source: To run NETCONF over SSH, the SSH client will first establish an SSH transport connection using the SSH transport protocol, and the SSH client and SSH server will exchange keys for message integrity and encryption.
ja: SSH上でNETCONFを実行するのに, クライアントはまずSSHトランスポート接続をSSHトランスポートプロトコルを用いて確立し, SSH クライアントと SSH サーバはメッセージ完全性と暗号化のための鍵を交換する.

source: Informally, the first recommendation is intended to protect against possible information leakage through the MAC tag, and the second recommendation is intended to protect against possible information leakage through the block cipher.
ja: 簡単に言うと, 1番目の推奨はMAGタグからの情報の漏洩を防ぐため, 2番目はブロック暗号からの情報の漏洩を防ぐためのものだ.

source: Note that the SSH transport does not interpret the XML content; thus, it does not care about any optional XML-specific LineFeeds.
ja: SSH のトランスポートは XML の内容を解釈しないので, XML 特有のオウプションのラインフィードについて関知しないことに注意.

source: SSH_MSG_USERAUTH_REQUEST C->S Contains the user's name, the name of the service the user is requesting, the name of the authentication method the client wishes to use, and method-specific fields.
ja: SSH_MSG_USERAUTH_REQUEST C->S ユーザ名と, ユーザが要求するサービス名, クライアントが利用を望む認証法の名前, メソッド固有のフィールドを含む.

source: The signature algorithm MUST be applied over H, not the original data.
ja: 元データではなく H に対して署名のアルゴリズムが適用されなければならない.

source: When a connection comes to a locally forwarded TCP/IP port, the following packet is sent to the other side.
ja: 接続がローカルに転送されたTCP/IPポートに来ると, 次のパケットが相手側に送られる.

source: The part following the at-sign MUST be a valid, fully qualified Internet domain name [10] controlled by the person or organization defining the name.
ja: アットマークに続く部分は, 名前を定義する個人ないし組織で管理されている有効な完全に記述したドメイン名 [10]でなければならない.

source: The value 0 represents FALSE, and the value 1 represents TRUE.
ja: 値 0 が FALSE を表し, 値 1 が TRUE を表す.

source: All names registered by the IANA in the following sections MUST be printable US-ASCII strings, and MUST NOT contain the characters at- sign ("@"), comma (","), whitespace, control characters (ASCII codes 32 or less), or the ASCII code 127 (DEL).
ja: 以降の節のIANAによって登録されるすべての名前は, 表示可能なUS-ASCIIの文字列で,アットマーク("@"), コンマ (","), スペース, 制御文字(ASCIIコード 32以下), ASCIIコードの127 (DEL)を含んではならない.

source: If the client has knowledge of the submethods preferred by the user, presumably through a configuration setting, it MAY use the submethods field to pass this information to the server.
ja: 設定などからクライアントがユーザの好む submethod について知っているなら, サーバにその情報を渡すために submethods フィールドを利用してもよい.

source: This will be done automatically for an SNMP application that initiates a transaction, such as a command generator, a notification originator, or a proxy forwarder.
ja: コマンド生成器, 通知の発信者, プロキシの転送者のような, トランザクションを開始する SNMP アプリケーションによって 自動的に行なわれる.

source: 4) ECDSA-256 MUST NOT be used to sign an ECDSA-384 public key.
ja: 4) ECDSA-256 は, ECDSA-384 公開鍵を署名するのに用いられてはならない.

source: For example, a Telnet session from an SSH shell should carry along an SSH-initiated BREAK, and an SSH client initiated from a Telnet connection SHOULD pass a BREAK indication from the Telnet connection.
ja: 例えば, SSH シェルからのTelnetセッションは, SSHを起点とする BREAK を転送する必要がある. Telnet 接続で始められた SSH クライアントは Telnet 接続からの BREAK 表示を転送する必要がある.

source: 8) At minLOS_128, each SecSh-B server and each SecSh-B user MUST have either an ECDSA-256 signing key with a corresponding X.509v3 certificate, an ECDSA-384 signing key with a corresponding X.509v3 certificate, or both.
ja: 8) minLOS_128 の場合, それぞれの SecSh-B サーバとそれぞれの SecSh-B ユーザは, 対応する X.509v3 証明書で ECDSA-256 署名鍵を持つか, 対応する X.509v3 証明書で ECDSA-384 鍵を持つか, その両方を持たなければならない.

source: SSH_MSG_KEX_DH_GEX_REQUEST_OLD is used for backward compatibility.
ja: SSH_MSG_KEX_DH_GEX_REQUEST_OLD は 後方互換性のために用いられる.

source: Each time the client receives the message described above, it makes another call to GSS_Init_sec_context().
ja: クライアントは上記のメッセージを受け取る度に,GSS_Init_sec_context()をまた呼び出さなければならない.

source: If the user may authenticate using one of several different submethods, the server should treat the submethods field as a hint on which submethod the user wants to use this time.
ja: ユーザがいくつかの異なるsubmethodの1つを用いて認証したい時, サーバは, ユーザがこの時に利用したい submethod のヒントとして submethods を取り扱う必要がある.

source: A party MAY send SSH_MSG_CHANNEL_CLOSE without having sent or received SSH_MSG_CHANNEL_EOF.
ja: SSH_MSG_CHANNEL_EOF を送信ないし受信せずに SSH_MSG_CHANNEL_CLOSE を送ってよい.

source: A client receiving this message SHOULD wait for the following SSH_MSG_USERAUTH_FAILURE message before beginning another authentication attempt.
ja: このメッセージを受け取ったクライアントは, 別の認証を試そうとする前に 次の SSH_MSG_USERAUTH_FAILURE を待つ必要がある.

source: There are also algorithms and methods that are defined in the protocol specification, but are OPTIONAL.
ja: さらに, プロトコルの仕様で定義されるアルゴリズムや実装がある. これらは選択できる.

source: The Version Packet .
ja: バージョンパケット .

source: If the user decides that the fingerprint is correct and accepts the key, the key is saved locally and used for verification for all following connections.
ja: 指紋が正しく鍵を受け入れるとユーザが決めると, 鍵はローカルに保存され今後の接続の検証に使われる.

source: Implementers should take care to notice that while the format is superficially similar to those specified by PEM [RFC1421] and OpenPGP [RFC2440], it is not identical; most notably:
ja: 実装者は, PEM[RFC1421] と OpenPGP [RFC2440] で指定された形式とこの形式が表面的に似ているが, 同一のものではないことに注意する必要がある. 特に以下の点に注意:

source: It has been noted that these names resemble STD 11 [9] email addresses.
ja: この名前が, STD 11 [9]のメールアドレスと似ていることを明記しておく.

source: The client then uses K_T to encrypt:
ja: そしてクライアントはK_Tを以下を暗号化するのに用いる.

source: Please refer to the current edition of the "Internet Official Protocol Standards" (STD 1) for the standardization state and status of this protocol.
ja: このプロトコルの標準化の状態と状況は "Internet Official Protocol Standards" (STD 1) の現在の版を参照してほしい.

source: The following table lists the initial assignments of Public Key Subsystem Attribute names.
ja: 次の表で, 公開鍵サブシステムの属性名の初期の割り当てを示す.

source: This process is followed by any SNMP engine to close an SSH session.
ja: このプロセスは, SSH のセッションを終了するすべての SNMP エンジンが従う.

source: Lowercase versions of the keywords should be read as in normal English.
ja: これらのキーワードの小文字のバージョンは, 通常の英語の意味で読まれるべきだ.

source: Error Status ..............................................17 3.9.
ja: エラー状態 ..............................................17 3.9.

source: If the server does not know a group that is larger than the client request, then it SHOULD return the largest group it knows.
ja: もしクライアントが要求するよりも大きな群をサーバが持っていなければ, 持っている一番大きな群を返す必要がある.

source: Some strings used for 'address to bind' have special-case semantics.
ja: 'address to bind' には, 特別な意味を持つ文字列がいくつか使われる.

source: o Extended text in Security Considerations; added text on EOM issues.
ja: o セキュリティの考察を拡張した; EOM 問題について追記した.

source: The sending Transport Model passes unencrypted messages from the Dispatcher to SSH to be encrypted, and the receiving Transport Model accepts decrypted incoming messages from SSH and passes them to the Dispatcher.
ja: 送信トランスポートモデルは, ディスパッチャから SSH に暗号化していないメッセージを送って暗号化させ, 受信トランスポートモデルは, SSH を用いて復号した受信メッセージを受け取りディスパッチャに渡す.

source: C computes K = f^x mod p, and H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K).
ja: K = e ^ y mod p, と H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K) を Cは計算する.

source: SSH_MSG_KEXECDH_REPLY S->C Contains a certificate with the server's ECDSA public signature key, the server's ephemeral ECDH contribution, and an ECDSA digital signature of the newly formed exchange hash value.
ja: SSH_MSG_KEXECDH_REPLY S->C サーバの ECDSA 公開署名鍵を持つ証明書, サーバの一時 ECDH contribution, 交換ハッシュ値で新しく作成されたECDSA 電子署名を含む.

source: Terminology
ja: 用語

source: As stated in the section on Algorithm Negotiation of [SSH-TRANS], each device will send a list of preferred methods for key exchange.
ja: [SSH-TRANS]のアルゴリズムネゴシエーションの節で述べるように, それぞれのデバイスは, 鍵交換について優先する方法のリストを送る.

source: Please note that, depending on the encryption method's block length L and the number of blocks encrypted per packet, recommendation (1) may supersede recommendation (2) or vice versa.
ja: 注意: 暗号法のブロック長 L と パケットごとの暗号化されたブロックの数によって, 推奨(1)が(2)を上書きするかもしれないし, また逆もある.

source: Rekeying ........................................................2 3.1.
ja: 鍵の再生成 ........................................................2 3.1.

source: The "twofish256-ctr" method uses Twofish with 256-bit keys.
ja: "twofish256-ctr" は 256-bit 鍵を用いる Twofish を使う.

source: However, if the client reads the user name in some other encoding (e.g., ISO 8859-1 - ISO Latin1), it MUST convert the user name to ISO-10646 UTF-8 before transmitting, and the server MUST convert the user name to the encoding used on that system for user names.
ja: しかし， クライアントがその他のエンコーディング(例えば ISO 8859-1 - ISO Latin1) でユーザ名を読み取ったら， クライアントは転送前に ISO-10646 UTF-8 へユーザ名を変換しなければならない． サーバは， ユーザ名のためにシステムで利用しているエンコーディングにユーザ名を変換しなければならない．

source: string public_key_blob // X.509v3 certificate
ja: string public_key_blob // X.509v3 証明書

source: 70 OPOST Enable output processing.
ja: 70 OPOST 出力処理を有効にする.

source: Connection Setup ................................................4 4.1.
ja: 接続のセットアップ...........................................4 4.1.

source: Closing a Session .........................................20 6.
ja: セッションの終了 .........................................20 6.

source: Authentication Protocol
ja: 認証プロトコル

source: o "0.0.0.0" means to listen on all IPv4 addresses.
ja: o "0.0.0.0" は, すべてのIPv4アドレスで受け入れることを意味する.

source: Note that these messages MAY also be sent for ports for which no forwarding has been explicitly requested.
ja: このメッセージは, ポートに対する転送が明示的に要求されることなく送られてもよいことに注意.

source: The "arcfour" cipher is the Arcfour stream cipher with 128-bit keys.
ja: "arcfour" 暗号は, 128-bit鍵を用いる Arcfour(Alleged RC4) ストリーム暗号だ.

source: The following message numbers have been defined for use with GSS- API-based key exchange methods:
ja: GSS-API ベースの鍵交換法で用いるために, 以下のメッセージ番号が定義されている:

source: The server SHOULD NOT halt the execution of the protocol stack when starting a shell or a program.
ja: サーバは, シェルやプログラムの起動時にプロトコルスタックの実行を停止しないほうがよい.

source: The following method-specific constants are used with this authentication method:
ja: 次の認証法特有の定数がこの認証法で使われる.

source: The 'comments' string SHOULD contain additional information that might be useful in solving user problems.
ja: 'comments' は, ユーザの問題を解決するのに有用な追加の情報を含む必要がある.

source: Requests for assignments of new Extended Channel Data Transfer 'data_type_code' values and their associated Extended Channel Data Transfer 'data' strings, in the range of 0x00000002 to 0xFDFFFFFF, MUST be done through the IETF CONSENSUS method as described in [RFC2434].
ja: 拡張チャンネルデータ転送の 'data_type_code' の値と関連する拡張チャンネルデータ転送の 'data' を割り当てる要求は, 0x00000002 から 0xFDFFFFFF の範囲については [RFC2434] に記述されている IETF CONSENSUS によってされなければならない.

source: Reserving other types requires IETF consensus [4].
ja: 他のタイプを予約するにはIETFの合意が必要だ[4].

source: Encryption, integrity, public key, and compression algorithms can be different for each direction.
ja: 暗号化や完全性, 公開鍵, 圧縮のアルゴリズムは, 通信の方向によって異なってもよい.

source: Digital Signatures and Certificates ........................4 2.3.
ja: 電子署名と証明書 ........................4 2.3.

source: Instead, the server SHOULD select the language used based on the tags communicated during key exchange [SSH-TRANS].
ja: 代わりに, サーバは鍵交換時に通信されるタグに基づいて言語を選択する必要がある [SSH-TRANS].

source: Each and every such key exchange method is implicitly registered by this specification.
ja: このような鍵交換法1つ1つすべてが， この指定によって暗黙的に登録される．

source: 37 IUCLC Translate uppercase characters to lowercase.
ja: 37 IUCLC 大文字を小文字に変換する.

source: The attribute-value field SHOULD be empty for this attribute.
ja: この属性の値は, 空の必要がある.

source: If the recipient of the SSH_MSG_CHANNEL_OPEN message does not support the specified 'channel type', it simply responds with SSH_MSG_CHANNEL_OPEN_FAILURE.
ja: SSH_MSG_CHANNEL_OPEN メッセージの受け取り手が 指定された 'channel type' をサポートしていないなら, SSH_MSG_CHANNEL_OPEN_FAILURE で単純に返答する.

source: Listing Public Keys
ja: 公開鍵の一覧の取得

source: This 'method name' MUST NOT be listed as supported by the server.
ja: サーバから送信する 'method_name' の値には, "none" を挙げてはならない.

source: A principal is the "who" on whose behalf services are provided or processing takes place.
ja: principal は, "誰か" に代わってサービスを提供されたりサービスを実行を処理したりする, その "誰か" のことだ.

source: Data sent with these messages consumes the same window as ordinary data.
ja: このメッセージで送られたデータは, 通常のデータと同じ window を消費する.

source: This description uses the following symbols, in addition to those defined above:
ja: 上記で定義したものに加えて， 以下のシンボルをこの記述では用いる．

source: The decryptor then increments its copy of the counter X and repeats the above process for each block to obtain the plaintext packet P=P1||P2||...||Pn.
ja: 復号器はカウンタ Ｘ のコピーをインクリメントする. 以上のプロセスをそれぞれのブロックに繰り返して 平文パケットP=P1||P2||...||Pn を得る.

source: If a token is also returned, then the SSH_MSG_USERAUTH_GSSAPI_TOKEN message MUST be sent before this one.
ja: トークンも返された場合, SSH_MSG_USERAUTH_GSSAPI_TOKEN メッセージをこのメッセージの前に送らなければならない.

source: IANA has assigned the names "rsa1024-sha1" and "rsa2048-sha256" as Key Exchange Method Names in accordance with [RFC4250].
ja: IANAは, 鍵交換法名として "rsa1024-sha1" と "rsa2048-sha256" を [RFC4250] に従って割り当てた.

source: For the REQUIRED elliptic curves nistp256, nistp384, and nistp521, the elliptic curve domain parameter identifiers are the strings "nistp256", "nistp384", and "nistp521".
ja: 必須の楕円曲線として, nistp256 と nistp384, nistp521 がある. 楕円曲線ドメインパラメータの識別子は, 文字列 "nistp256" と "nistp384", "nistp521" だ.

source: Requesting a Pseudo-Terminal
ja: 擬似ターミナルの要求

source: Because of a birthday property of block ciphers and some modes of operation, implementations must be careful not to encrypt too many blocks with the same encryption key.
ja: ブロック暗号の誕生日の特性と暗号モードがいくつか存在するために, 実装は同じ暗号化鍵で多すぎるブロックを暗号化しないよう注意しなければならない.

source: The reader is reminded that, as specified in [SSH-GCM], Suite B requires that all 16 octets of the authentication tag MUST be used as the SSH data integrity value of the SSH binary packet.
ja: [SSH-GCM] で指定されているように, 認証タグの 16 オクテットすべてが SSH バイナリパケットの SSH データ完全性の値として用いられなければならないことを Suite B が要求することに注意すること.

source: Host keys can also change.
ja: ホスト鍵も変更できる.

source: Either side may open a channel.
ja: どちらの側からもチャンネルを開ける.

source: This document formally describes an existing public key file format that can be used with any of the common existing file transfer mechanisms in order to exchange public keys.
ja: この文書は, 公開鍵を交換するために既存の任意の共通ファイル転送メカニズムが利用できる既存の公開鍵ファイルフォーマットを公式に記述する.

source: S generates a random number y, where 0 < y < (p-1)/2, and computes f = g^y mod p.
ja: S は 0 < y < (p-1)/2 な乱数 y を生成し f = g^y mod p を計算する.

source: The contents of the MIC field are obtained by calling GSS_GetMIC() over the following, using the GSS-API context that was just established:
ja: MIC フィールドの内容は, ちょうど確立したばかりの GSS-API コンテキストを利用して 以下に対して GSS_Get_MIC() を呼び出すことで得られる

source: Data Type Representations Used in the SSH Protocols .............8 6.
ja: SSH プロトコルで利用されるデータ型の表現 .............8 6.

source: The key exchange method specifies how one-time session keys are generated for encryption and for authentication, and how the server authentication is done.
ja: 鍵交換法は, 暗号と認証のための一時的なセッション鍵がどう作られるかとサーバ認証がどう行なわれるかを指定する.

source: Every SSH ECC implementation MUST support the named curves below.
ja: すべての SSH 楕円曲線暗号実装は, 以下の指定された曲線をサポートしなければならない.

source: Implementers SHOULD be wary of exposing this feature for any purpose other than debugging.
ja: 実装者は, デバッグ以外の目的でこの特徴を利用することに慎重な必要がある.

source: Other GSS-API Key Exchange Methods
ja: その他の GSS-API 鍵交換法

source: We divide the non-signature algorithms into two families, as shown in Table 1.
ja: 署名以外のアルゴリズムを表1に示すように2つのファミリに分割する.

source: Note that "none" must be explicitly listed if it is to be acceptable.
ja: "none" が受け入れられる場合には, 明示的に挙げなければならないことに注意.

source: Fingerprint Type Specification ......................4 3.1.3.
ja: 指紋のタイプの仕様 ......................4 3.1.3.

source: Localization and Character Set Support .....................7 5.
ja: 地域化と文字セットのサポート .....................7 5.

source: To continue the example used in previous sections, an existing NETCONF subsystem session could be closed as follows:
ja: 前の節で利用した例に続いて, 既存の NETCONF サブシステムを終了する例は以下だ:

source: Diffie-Hellman Group Exchange for the Secure Shell (SSH) Transport Layer Protocol
ja: セキュア シェル (SSH) トランスポート層プロトコルのための Diffie-Hellman 群交換

source: Additional motivation and discussion, as well as proofs of security, appear in the research papers [BKN1,BKN2].
ja: さらなる動機と議論, セキュリティの証明は, 研究論文 [BKN1,BKN2] にある.

source: Initial Server Response
ja: 最初のサーバの応答

source: If the language tag is not the empty string, the server SHOULD use the specified language for any messages sent to the client as part of this protocol.
ja: もし, language tag が空の文字列でなかったら, サーバは, このプロトコルの一部としてクライアントへ送るすべてのメッセージに指定された言語を用いる必要がある.

source: As this document only provides new public key algorithms and key exchange methods within the existing Secure Shell protocol architecture, there are few manageability considerations beyond those that apply for existing Secure Shell implementations.
ja: この文書は, 既存のセキュアシェルプロトコルアーキテクチャに新しい公開鍵アルゴリズムと鍵交換法を提供しているだけで, 既存のセキュアシェル実装への適用されている管理の上での考慮を越えるものはほとんどない.

source: A prime p is safe if p = 2q + 1 and q is prime.
ja: 素数 p が安全とは, p = 2q + 1 な q が素数の場合だ.

source: The Header-value MUST be encoded in UTF-8 [RFC3629].
ja: Header-value は UTF-8 [RFC3629] でエンコードされなければならない.

source: Improved Arcfour Modes for the Secure Shell (SSH) Transport Layer Protocol
ja: セキュア シェル (SSH) トランスポート層プロトコルの 改良された Arcfour モード

source: The language tag SHOULD NOT be used for language selection for messages outside of this protocol.
ja: language tag を, このプロトコル外部のメッセージの言語選択に使わないほうがよい.

source: If either of these features is not supported by a particular GSS-API mechanism, or by a particular implementation of a GSS-API mechanism, then the key exchange is not secure and MUST fail.
ja: 特定の GSS-API メカニズムで もしくは 特定の GSS-API メカニズムの実装で, これらの特徴のどちらかがサポートされていなかったら, 鍵交換は安全ではなく失敗しなければならない.

source: Message Authentication
ja: メッセージ認証

source: The SSHFP Resource Record
ja: SSHFP リソースレコード

source: The authentication tag produced by AES-GCM authenticated encryption will be placed in the MAC field at the end of the secure shell binary packet.
ja: AES-GCM 認証付き暗号化で生成される認証タグは, セキュアシェルのバイナリパケットの末尾の MAC フィールドに配置される.

source: The packet sequence_number itself is not included in the packet sent over the wire.
ja: パケットの sequence_number 自体は, 通信で送られるパケットには含まれない.

source: The Break Request
ja: Break 要求

source: Because an AEAD algorithm such as AES-GCM uses the encryption key to provide both confidentiality and data integrity, the integrity key is not used with AES-GCM.
ja: AES-GCM のような AEAD アルゴリズムは機密性とデータの完全性を提供するのに暗号鍵を用いるので, 完全性鍵は AES-GCM では利用されない.

source: The validation could be done using the user name and user password attributes.
ja: この検証は, ユーザ名とユーザパスワードの属性を用いて行なえる.

source: The server drives the authentication by telling the client which authentication methods can be used to continue the exchange at any given time.
ja: サーバは, やりとりを続けるためにその時点でどの認証法が利用できるかクライアントに伝えることで認証を始める.

source: Implementations MUST reject any X11 channel open requests if they have not requested X11 forwarding.
ja: X11転送が要求されていない場合には, 実装はどのX11 チャンネル開始要求も拒否しなければならない.

source: 90 CS7 7 bit mode.
ja: 90 CS7 7 bit モード.

source: Assigned Algorithm Names .................................16 4.11.1.
ja: 割り当て済みのアルゴリズム名.........................16 4.11.1.

source: It is intended only to create the initial state of the IANA databases for the SSH protocol and also contains instructions for future assignments.
ja: SSHプロトコルについてのIANAのデータベースの初期状態を作ることだけが目的だ. また, 将来の割り当てについての指示も含んでいる.

source: As we shall see below, the ECDSA-256/384 signature algorithms and corresponding X.509v3 certificates are treated somewhat differently than the non-signature primitives (kex algorithms, encryption algorithms, and Message Authentication Code (MAC) algorithms in Secure Shell parlance).
ja: 以下で見るように, ECDSA-256/384 署名アルゴリズムと対応する X.509v3 証明書は, 署名以外のプリミティブ(セキュアシェルの用語では, 鍵交換アルゴリズム, 暗号化アルゴリズム, メッセージ認証コード (MAC) アルゴリズム) とはいくぶん異なった取り扱いをされる.

source: AES GCM Authenticated Decryption
ja: AES GCM の認証付き復号

source: Examples:
ja: 例:

source: The SSH Transport Model determines from SSH the identity of the authenticated principal and the type and address associated with an incoming message, and provides this information to SSH for an outgoing message.
ja: SSH トランスポートモデルは, 認証されたプリンシパルの識別情報と受信メッセージに関連するタイプとアドレスを SSH から決定する. また, 送信メッセージにこの情報を提供する.

source: The "3des-cbc" cipher is three-key triple-DES (encrypt-decrypt- encrypt), where the first 8 bytes of the key are used for the first encryption, the next 8 bytes for the decryption, and the following 8 bytes for the final encryption.
ja: "3des-cbc" 暗号は, 3つの鍵を用いる triple-DES (encrypt-decrypt-encrypt)で, 鍵の最初の8byteが最初の暗号化に用いられ, 次の8byteが復号に用いられ, 続く8byteが最後の暗号化に用いられる.

source: Window Dimension Change Message
ja: ウィンドウ容量変更メッセージ

source: This makes it difficult to add new mechanisms for authentication as all clients must be updated to support the new mechanism.
ja: これにより, 新しい認証メカニズムを追加するには, すべてのクライアントがその新しいメカニズムをサポートするために更新されなければならず, 新しいメカニズムの追加を困難にしている.

source: Additionally, the key exchange methods defined in this document rely on the SHA2 family of hash functions, defined in [FIPS-180-3].
ja: また, この文書で定義された鍵交換法は, [FIPS-180-3] で定義されたハッシュ関数 SHA2ファミリに依存している.
